# SQL запити

In [1]:
%load_ext sql
%sql mysql://root@localhost

Connecting to 'mysql://root@localhost'

In [2]:
%%sql 
DROP DATABASE IF EXISTS test;

Running query in 'mysql://root@localhost'

4 rows affected.

++
||
++
++

In [3]:
# | label: database-list-before-create
%sql SHOW DATABASES;

Running query in 'mysql://root@localhost'

4 rows affected.

+--------------------+
|      Database      |
+--------------------+
| information_schema |
|       mysql        |
| performance_schema |
|        sys         |
+--------------------+

In [4]:
# | label: database-create
%sql CREATE DATABASE test;

Running query in 'mysql://root@localhost'

1 rows affected.

++
||
++
++

In [5]:
# | label: database-list-after-create
%sql SHOW DATABASES;

Running query in 'mysql://root@localhost'

5 rows affected.

+--------------------+
|      Database      |
+--------------------+
| information_schema |
|       mysql        |
| performance_schema |
|        sys         |
|        test        |
+--------------------+

In [6]:
%sql mysql://root@localhost/test

Connecting and switching to connection 'mysql://root@localhost/test'

In [7]:
%%sql 
CREATE TABLE `books` (
    `id` int NOT NULL AUTO_INCREMENT,
    `category_id` int DEFAULT NULL,
    `title` text,
    `year` smallint DEFAULT NULL,
    PRIMARY KEY (`id`)
);

Running query in 'mysql://root@localhost/test'

++
||
++
++

In [8]:
%%sql

CREATE TABLE `authors` (
    `id` int NOT NULL AUTO_INCREMENT,
    `name` text,
    PRIMARY KEY (`id`)
);

CREATE TABLE `books_authors` (
    `book_id` int NOT NULL,
    `author_id` int NOT NULL
);

CREATE TABLE `categories` (
    `id` int NOT NULL AUTO_INCREMENT,
    `name` text,
    PRIMARY KEY (`id`)
);

Running query in 'mysql://root@localhost/test'

++
||
++
++

In [9]:
# | label: show-tables
%sql SHOW TABLES

Running query in 'mysql://root@localhost/test'

4 rows affected.

+----------------+
| Tables_in_test |
+----------------+
|    authors     |
|     books      |
| books_authors  |
|   categories   |
+----------------+

In [10]:
%%sql

ALTER TABLE `books_authors` ADD CONSTRAINT books_book_id
FOREIGN KEY (`book_id`) REFERENCES `books` (`id`);

ALTER TABLE `books_authors` ADD CONSTRAINT authors_author_id
FOREIGN KEY (`author_id`) REFERENCES `authors` (`id`);

ALTER TABLE `books` ADD CONSTRAINT categories_category_id
FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`);

Running query in 'mysql://root@localhost/test'

++
||
++
++

In [11]:
%%sql

INSERT INTO `authors` (`name`)
VALUES
    ('Author Name 1'),
    ('Author Name 2'),
    ('Author Name 3'),
    ('Author Name 4'),
    ('Author Name 5');

INSERT INTO `categories` (`name`)
VALUES
    ('Fiction'),
    ('Non-Fiction'),
    ('Science Fiction'),
    ('Mystery'),
    ('Romance');

INSERT INTO `books` (`category_id`, `title`, `year`)
VALUES
    (1, 'Book Title 1', 2022),
    (2, 'Book Title 2', 2019),
    (1, 'Book Title 3', 2020),
    (3, 'Book Title 4', 2021),
    (2, 'Book Title 5', 2018),
    (3, 'Book Title 6', 2017),
    (1, 'Book Title 7', 2016),
    (2, 'Book Title 8', 2015),
    (3, 'Book Title 9', 2014),
    (1, 'Book Title 10', 2013);

INSERT INTO `books_authors` (`book_id`, `author_id`)
VALUES
    (1, 1),
    (1, 2),
    (2, 2),
    (3, 3),
    (4, 4),
    (5, 5),
    (6, 1),
    (7, 2),
    (8, 3),
    (9, 4);

Running query in 'mysql://root@localhost/test'

5 rows affected.

5 rows affected.

10 rows affected.

10 rows affected.

++
||
++
++

In [12]:
%%sql
SELECT * FROM books;

Running query in 'mysql://root@localhost/test'

10 rows affected.

+----+-------------+---------------+------+
| id | category_id |     title     | year |
+----+-------------+---------------+------+
| 1  |      1      |  Book Title 1 | 2022 |
| 2  |      2      |  Book Title 2 | 2019 |
| 3  |      1      |  Book Title 3 | 2020 |
| 4  |      3      |  Book Title 4 | 2021 |
| 5  |      2      |  Book Title 5 | 2018 |
| 6  |      3      |  Book Title 6 | 2017 |
| 7  |      1      |  Book Title 7 | 2016 |
| 8  |      2      |  Book Title 8 | 2015 |
| 9  |      3      |  Book Title 9 | 2014 |
| 10 |      1      | Book Title 10 | 2013 |
+----+-------------+---------------+------+
Truncated to displaylimit of 10.

In [13]:
%%sql
SELECT
    b.title AS book_title,
    a.name AS author_name
FROM
    books_authors ba
JOIN
    books b ON ba.book_id = b.id
JOIN
    authors a ON ba.author_id = a.id;

Running query in 'mysql://root@localhost/test'

10 rows affected.

+--------------+---------------+
|  book_title  |  author_name  |
+--------------+---------------+
| Book Title 1 | Author Name 1 |
| Book Title 6 | Author Name 1 |
| Book Title 1 | Author Name 2 |
| Book Title 2 | Author Name 2 |
| Book Title 7 | Author Name 2 |
| Book Title 3 | Author Name 3 |
| Book Title 8 | Author Name 3 |
| Book Title 4 | Author Name 4 |
| Book Title 9 | Author Name 4 |
| Book Title 5 | Author Name 5 |
+--------------+---------------+
Truncated to displaylimit of 10.

In [14]:
%%sql
SELECT * FROM books;

Running query in 'mysql://root@localhost/test'

10 rows affected.

+----+-------------+---------------+------+
| id | category_id |     title     | year |
+----+-------------+---------------+------+
| 1  |      1      |  Book Title 1 | 2022 |
| 2  |      2      |  Book Title 2 | 2019 |
| 3  |      1      |  Book Title 3 | 2020 |
| 4  |      3      |  Book Title 4 | 2021 |
| 5  |      2      |  Book Title 5 | 2018 |
| 6  |      3      |  Book Title 6 | 2017 |
| 7  |      1      |  Book Title 7 | 2016 |
| 8  |      2      |  Book Title 8 | 2015 |
| 9  |      3      |  Book Title 9 | 2014 |
| 10 |      1      | Book Title 10 | 2013 |
+----+-------------+---------------+------+
Truncated to displaylimit of 10.

In [15]:
%%sql
DELETE FROM `books` WHERE `id` = 1;

Running query in 'mysql://root@localhost/test'

RuntimeError: (MySQLdb.IntegrityError) (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`test`.`books_authors`, CONSTRAINT `books_book_id` FOREIGN KEY (`book_id`) REFERENCES `books` (`id`))')
[SQL: DELETE FROM `books` WHERE `id` = 1;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [16]:
%%sql
DELETE FROM `books_authors` WHERE `book_id` = 1;
DELETE FROM `books` WHERE  `id` = 1;

Running query in 'mysql://root@localhost/test'

2 rows affected.

1 rows affected.

++
||
++
++

In [17]:
%%sql
SELECT * FROM books;

Running query in 'mysql://root@localhost/test'

9 rows affected.

+----+-------------+---------------+------+
| id | category_id |     title     | year |
+----+-------------+---------------+------+
| 2  |      2      |  Book Title 2 | 2019 |
| 3  |      1      |  Book Title 3 | 2020 |
| 4  |      3      |  Book Title 4 | 2021 |
| 5  |      2      |  Book Title 5 | 2018 |
| 6  |      3      |  Book Title 6 | 2017 |
| 7  |      1      |  Book Title 7 | 2016 |
| 8  |      2      |  Book Title 8 | 2015 |
| 9  |      3      |  Book Title 9 | 2014 |
| 10 |      1      | Book Title 10 | 2013 |
+----+-------------+---------------+------+

In [18]:
%%sql
SELECT * FROM books WHERE id = 2;

Running query in 'mysql://root@localhost/test'

1 rows affected.

+----+-------------+--------------+------+
| id | category_id |    title     | year |
+----+-------------+--------------+------+
| 2  |      2      | Book Title 2 | 2019 |
+----+-------------+--------------+------+

In [19]:
%%sql
UPDATE books SET category_id = 4 WHERE id = 2;

Running query in 'mysql://root@localhost/test'

1 rows affected.

++
||
++
++

In [20]:
%%sql
SELECT * FROM books WHERE id = 2;

Running query in 'mysql://root@localhost/test'

1 rows affected.

+----+-------------+--------------+------+
| id | category_id |    title     | year |
+----+-------------+--------------+------+
| 2  |      4      | Book Title 2 | 2019 |
+----+-------------+--------------+------+

In [21]:
%%sql
SELECT * FROM books;

Running query in 'mysql://root@localhost/test'

9 rows affected.

+----+-------------+---------------+------+
| id | category_id |     title     | year |
+----+-------------+---------------+------+
| 2  |      4      |  Book Title 2 | 2019 |
| 3  |      1      |  Book Title 3 | 2020 |
| 4  |      3      |  Book Title 4 | 2021 |
| 5  |      2      |  Book Title 5 | 2018 |
| 6  |      3      |  Book Title 6 | 2017 |
| 7  |      1      |  Book Title 7 | 2016 |
| 8  |      2      |  Book Title 8 | 2015 |
| 9  |      3      |  Book Title 9 | 2014 |
| 10 |      1      | Book Title 10 | 2013 |
+----+-------------+---------------+------+

In [22]:
%%sql 
SELECT title, year FROM books;

Running query in 'mysql://root@localhost/test'

9 rows affected.

+---------------+------+
|     title     | year |
+---------------+------+
|  Book Title 2 | 2019 |
|  Book Title 3 | 2020 |
|  Book Title 4 | 2021 |
|  Book Title 5 | 2018 |
|  Book Title 6 | 2017 |
|  Book Title 7 | 2016 |
|  Book Title 8 | 2015 |
|  Book Title 9 | 2014 |
| Book Title 10 | 2013 |
+---------------+------+

In [23]:
%%sql 
SELECT * FROM books WHERE year > 2019;

Running query in 'mysql://root@localhost/test'

2 rows affected.

+----+-------------+--------------+------+
| id | category_id |    title     | year |
+----+-------------+--------------+------+
| 3  |      1      | Book Title 3 | 2020 |
| 4  |      3      | Book Title 4 | 2021 |
+----+-------------+--------------+------+

In [24]:
%%sql 
SELECT * FROM books ORDER BY year DESC;

Running query in 'mysql://root@localhost/test'

9 rows affected.

+----+-------------+---------------+------+
| id | category_id |     title     | year |
+----+-------------+---------------+------+
| 4  |      3      |  Book Title 4 | 2021 |
| 3  |      1      |  Book Title 3 | 2020 |
| 2  |      4      |  Book Title 2 | 2019 |
| 5  |      2      |  Book Title 5 | 2018 |
| 6  |      3      |  Book Title 6 | 2017 |
| 7  |      1      |  Book Title 7 | 2016 |
| 8  |      2      |  Book Title 8 | 2015 |
| 9  |      3      |  Book Title 9 | 2014 |
| 10 |      1      | Book Title 10 | 2013 |
+----+-------------+---------------+------+

In [25]:
%%sql 
SELECT category_id, COUNT(*) AS book_count FROM books
GROUP BY category_id;

Running query in 'mysql://root@localhost/test'

4 rows affected.

+-------------+------------+
| category_id | book_count |
+-------------+------------+
|      1      |     3      |
|      2      |     2      |
|      3      |     3      |
|      4      |     1      |
+-------------+------------+

In [26]:
%%sql
SELECT
    books.id AS book_id,
    books.title AS book_title,
    books.year,
    authors.id AS author_id,
    authors.name AS author_name,
    categories.id AS category_id,
    categories.name AS category_name
FROM
    books
JOIN
    books_authors ON books.id = books_authors.book_id
JOIN
    authors ON books_authors.author_id = authors.id
LEFT JOIN
    categories ON books.category_id = categories.id;

Running query in 'mysql://root@localhost/test'

8 rows affected.

+---------+--------------+------+-----------+---------------+-------------+-----------------+
| book_id |  book_title  | year | author_id |  author_name  | category_id |  category_name  |
+---------+--------------+------+-----------+---------------+-------------+-----------------+
|    6    | Book Title 6 | 2017 |     1     | Author Name 1 |      3      | Science Fiction |
|    2    | Book Title 2 | 2019 |     2     | Author Name 2 |      4      |     Mystery     |
|    7    | Book Title 7 | 2016 |     2     | Author Name 2 |      1      |     Fiction     |
|    3    | Book Title 3 | 2020 |     3     | Author Name 3 |      1      |     Fiction     |
|    8    | Book Title 8 | 2015 |     3     | Author Name 3 |      2      |   Non-Fiction   |
|    4    | Book Title 4 | 2021 |     4     | Author Name 4 |      3      | Science Fiction |
|    9    | Book Title 9 | 2014 |     4     | Author Name 4 |      3      | Science Fiction |
|    5    | Book Title 5 | 2018 |     5     | Author Name 5 |      2      |   Non-Fiction   |
+---------+--------------+------+-----------+---------------+-------------+-----------------+